import { ContentList } from "../drop-down";

const listsData = [
  {
    title: "الصفحات الشخصية",
    list: ["إدارة الطلبات", "إدارة الرخص", "لوحة التحكم"],
  },
  {
    title: "المنظمات والأنظمة",
    list: [
      "منصة رسم إشغال مرافق الإيواء",
      "منصة رسم تقديم منتجات التبغ",
      "بلدي أعمال",
      "تصنيف مقدمي خدمات المدن",
    ],
  },
  {
    title: "التفويض البلدي الإلكتروني",
    list: [
      "إضافة منشأة إلى مدير حساب",
      "الاستعلام عن طلبات منشأة",
      "الاستعلام عن مفوضي منشأة",
    ],
  },
  {
    title: "الرخص التجارية",
    list: [
      "إصدار رخصة تجارية",
      "تجديد رخصة نشاط تجاري",
      "إلغاء رخصة نشاط تجاري",
    ],
  },
  {
    title: "الرخص الإنشائية",
    list: ["إصدار رخصة بناء", "خدمة إصدار رخصة تسوير أراضي فضاء"],
  },
  {
    title: "الشهادات الصحية",
    list: ["إصدار شهادة صحية", "تجديد شهادة صحية"],
  },
  {
    title: "خدمات تنسيق المشروعات",
    list: ["خدمات تنسيق أعمال البنية التحتية", "خدمات تنسيق المشروعات الكبرى"],
  },
  {
    title: "خدمات التقارير المساحية",
    list: ["إصدار تقرير مساحي"],
  },
  {
    title: "تحديث الصكوك",
    list: ["تحديث صك إلكتروني"],
  },
];

export function Services() {
  return (
    <>
      <div className="grid grid-cols-1 md:grid-cols-3 w-full gap-10 ">
        {listsData.map((item,index) => (
          <div key={index}>
            <ContentList title={item.title} list={item.list} />
          </div>
        ))}
      </div>
    </>
  );
}
